task/task-c/openfoam/task-10/init_file/buoyant_base/0/p_rgh
FoamFile
{
    format ascii;
    class volScalarField;
    object p_rgh;
}
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    leftWall { type fixedFluxPressure; value uniform 0; }
    rightWall { type fixedFluxPressure; value uniform 0; }
    bottomWall { type fixedFluxPressure; value uniform 0; }
    topWall { type fixedFluxPressure; value uniform 0; }
    frontAndBack { type empty; }
}
