task/task-c/openfoam/task-10/init_file/buoyant_base/system/blockMeshDict
FoamFile
{
    format ascii;
    class dictionary;
    object blockMeshDict;
}
convertToMeters 1;
vertices
(
    (0 0 0)
    (1 0 0)
    (1 0.1 0)
    (0 0.1 0)
    (0 0 0.01)
    (1 0 0.01)
    (1 0.1 0.01)
    (0 0.1 0.01)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (120 24 1) simpleGrading (1 1 1) // TODO_NX TODO_NY
);
boundary
(
    leftWall { type wall; faces ((0 3 7 4)); }
    rightWall { type wall; faces ((1 5 6 2)); }
    bottomWall { type wall; faces ((0 4 5 1)); }
    topWall { type wall; faces ((3 2 6 7)); }
    frontAndBack
    {
        type empty;
        faces ((0 1 2 3) (4 7 6 5));
    }
);
